#pragma once

#include "fallout_shared/tesform.h"
#include "types.h"

class Script;
class ScriptCompileData;
class ScriptLocals;
struct SCRIPT_PARAMETER;
struct SCRIPT_LINE;

enum EXPRESSION_OPERATORS {
    EXP_LEFTPAREN = 0x0000,
    EXP_RIGHTPAREN = 0x0001,
    EXP_AND = 0x0002,
    EXP_OR = 0x0003,
    EXP_LESSEQUAL = 0x0004,
    EXP_LESS = 0x0005,
    EXP_GREATEREQUAL = 0x0006,
    EXP_GREATER = 0x0007,
    EXP_EQUAL = 0x0008,
    EXP_NOTEQUAL = 0x0009,
    EXP_SUBTRACT = 0x000a,
    EXP_ADD = 0x000b,
    EXP_MULTIPLY = 0x000c,
    EXP_DIVIDE = 0x000d,
    EXP_MODULUS = 0x000e,
    EXP_UNARYMINUS = 0x000f,
    EXP_COUNT = 0x0010,
};

enum SCRIPT_BLOCK {
    SCRIPT_BLOCK_GAME = 0x0000,
    SCRIPT_BLOCK_MENUMODE = 0x0001,
    SCRIPT_BLOCK_ONACTIVATE = 0x0002,
    SCRIPT_BLOCK_ONADD = 0x0003,
    SCRIPT_BLOCK_ONEQUIP = 0x0004,
    SCRIPT_BLOCK_ONUNEQUIP = 0x0005,
    SCRIPT_BLOCK_ONDROP = 0x0006,
    SCRIPT_BLOCK_ONSAYTODONE = 0x0007,
    SCRIPT_BLOCK_ONHIT = 0x0008,
    SCRIPT_BLOCK_ONHITWITH = 0x0009,
    SCRIPT_BLOCK_ONDEATH = 0x000a,
    SCRIPT_BLOCK_ONMURDER = 0x000b,
    SCRIPT_BLOCK_ONCOMBATEND = 0x000c,
    SCRIPT_BLOCK_UNUSED = 0x000d,
    SCRIPT_BLOCK_UNUSED2 = 0x000e,
    SCRIPT_BLOCK_ONPACKAGESTART = 0x000f,
    SCRIPT_BLOCK_ONPACKAGEEND = 0x0010,
    SCRIPT_BLOCK_SCRIPTEFFECTSTART = 0x0011,
    SCRIPT_BLOCK_SCRIPTEFFECTFINISH = 0x0012,
    SCRIPT_BLOCK_SCRIPTEFFECTUPDATE = 0x0013,
    SCRIPT_BLOCK_ONPACKAGECHANGE = 0x0014,
    SCRIPT_BLOCK_ONLOAD = 0x0015,

    FUNCTION_SWAP_TEXTURE = 0x1269,
    FUNCTION_DISABLE_HARDCORE_TRACKING = 0x126a,
    FUNCTION_GET_IS_ALWAYS_HARDCORE_BOOL = 0x126b,
    FUNCTION_REMOVE_RECURRING_FROM_CHALLENGE = 0x126c,
    FUNCTION_RESET_EXP = 0x126d,
    FUNCTION_GET_DLC_COUNT = 0x126e,
    FUNCTION_IS_DLC_INSTALLED = 0x126f,
    END_OF_FUNCTION_SECTION = 0x1270,
    FUNCTION_COUNT = 0x0270,
    SCRIPT_DONE = 0xffff,
};

enum SCRIPT_PARAM_TYPE {
    SCRIPT_PARAM_CHAR = 0x0000,
    SCRIPT_PARAM_INT = 0x0001,
    SCRIPT_PARAM_FLOAT = 0x0002,
    SCRIPT_PARAM_INVENTORY_OBJECT = 0x0003,
    SCRIPT_PARAM_OBJECTREF = 0x0004,
    SCRIPT_PARAM_ACTOR_VALUE = 0x0005,
    SCRIPT_PARAM_ACTOR = 0x0006,
    SCRIPT_PARAM_SPELL_ITEM = 0x0007,
    SCRIPT_PARAM_AXIS = 0x0008,
    SCRIPT_PARAM_CELL = 0x0009,
    SCRIPT_PARAM_ANIM_GROUP = 0x000a,
    SCRIPT_PARAM_MAGIC_ITEM = 0x000b,
    SCRIPT_PARAM_SOUND = 0x000c,
    SCRIPT_PARAM_TOPIC = 0x000d,
    SCRIPT_PARAM_QUEST = 0x000e,
    SCRIPT_PARAM_RACE = 0x000f,
    SCRIPT_PARAM_CLASS = 0x0010,
    SCRIPT_PARAM_FACTION = 0x0011,
    SCRIPT_PARAM_SEX = 0x0012,
    SCRIPT_PARAM_GLOBAL = 0x0013,
    SCRIPT_PARAM_FURNITURE_OR_FORMLIST = 0x0014,
    SCRIPT_PARAM_OBJECT = 0x0015,
    SCRIPT_PARAM_SCRIPT_VAR = 0x0016,
    SCRIPT_PARAM_STAGE = 0x0017,
    SCRIPT_PARAM_MAP_MARKER = 0x0018,
    SCRIPT_PARAM_ACTOR_BASE = 0x0019,
    SCRIPT_PARAM_CONTAINER_REF = 0x001a,
    SCRIPT_PARAM_WORLD = 0x001b,
    SCRIPT_PARAM_CRIME_TYPE = 0x001c,
    SCRIPT_PARAM_PACKAGE = 0x001d,
    SCRIPT_PARAM_COMBAT_STYLE = 0x001e,
    SCRIPT_PARAM_MAGIC_EFFECT = 0x001f,
    SCRIPT_PARAM_FORM_TYPE = 0x0020,
    SCRIPT_PARAM_WEATHER = 0x0021,
    SCRIPT_PARAM_NPC = 0x0022,
    SCRIPT_PARAM_OWNER = 0x0023,
    SCRIPT_PARAM_SHADER_EFFECT = 0x0024,
    SCRIPT_PARAM_FORMLIST = 0x0025,
    SCRIPT_PARAM_MENUICON = 0x0026,
    SCRIPT_PARAM_PERK = 0x0027,
    SCRIPT_PARAM_NOTE = 0x0028,
    SCRIPT_PARAM_MISC_STAT = 0x0029,
    SCRIPT_PARAM_IMAGESPACEMOD = 0x002a,
    SCRIPT_PARAM_IMAGESPACE = 0x002b,
    SCRIPT_PARAM_VATS_VALUE = 0x002c,
    SCRIPT_PARAM_VATS_VALUE_DATA = 0x002d,
    SCRIPT_PARAM_VOICE_TYPE = 0x002e,
    SCRIPT_PARAM_ENCOUNTERZONE = 0x002f,
    SCRIPT_PARAM_IDLE_FORM = 0x0030,
    SCRIPT_PARAM_MESSAGE = 0x0031,
    SCRIPT_PARAM_INVOBJECT_OR_FORMLIST = 0x0032,
    SCRIPT_PARAM_ALIGNMENT = 0x0033,
    SCRIPT_PARAM_EQUIPTYPE = 0x0034,
    SCRIPT_PARAM_OBJECT_OR_FORMLIST = 0x0035,
    SCRIPT_PARAM_MUSIC = 0x0036,
    SCRIPT_PARAM_CRITSTAGE = 0x0037,
    SCRIPT_PARAM_NPC_OR_LEVCHAR = 0x0038,
    SCRIPT_PARAM_CREA_OR_LEVCREA = 0x0039,
    SCRIPT_PARAM_LEVCHAR = 0x003a,
    SCRIPT_PARAM_LEVCREA = 0x003b,
    SCRIPT_PARAM_LEVITEM = 0x003c,
    SCRIPT_PARAM_FORM = 0x003d,
    SCRIPT_PARAM_REPUTATION = 0x003e,
    SCRIPT_PARAM_CASINO = 0x003f,
    SCRIPT_PARAM_CASINOCHIP = 0x0040,
    SCRIPT_PARAM_CHALLENGE = 0x0041,
    SCRIPT_PARAM_CARAVANMONEY = 0x0042,
    SCRIPT_PARAM_CARAVANCARD = 0x0043,
    SCRIPT_PARAM_CARAVANDECK = 0x0044,
    SCRIPT_PARAM_REGION = 0x0045,
    SCRIPT_PARAM_COUNT = 0x0046,
};

struct ACTION_OBJECT {
    TESForm *pForm; // 0x0
    uint iFlags; // 0x4
};

struct FUNCTION_DATA { /* Size=0xc */
    u16 iFunction; // 0x0
    void *pParam[2]; // 0x4

    void Endian();
};

struct SCRIPT_EFFECT_DATA {
    bool m_bScriptEffectStart; // 0x0
    bool m_bScriptEffectFinish; // 0x1
    float m_fSecondsElapsed; // 0x4

    void Endian();
};

struct SCRIPT_FUNCTION {
    char *pFunctionName; // 0x00
    char *pShortName; // 0x04
    SCRIPT_OUTPUT eOutput; // 0x08
    char *pHelpString; // 0x0c
    bool bReferenceFunction; // 0x10
    unsigned short sParamCount; // 0x12
    SCRIPT_PARAMETER *pParameters; // 0x14
    bool (*pExecuteFunction)(
        const SCRIPT_PARAMETER *,
        const char *,
        TESObjectREFR *,
        TESObjectREFR *,
        Script *,
        ScriptLocals *,
        double &,
        uint &
    ); // 0x18
    bool (*pCompileFunction)(
        const unsigned short, const SCRIPT_PARAMETER *, SCRIPT_LINE *, ScriptCompileData *
    ); // 0x1c
    bool (*pConditionFunction)(TESObjectREFR *, void *, void *, double &); // 0x20
    bool bEditorFilter; // 0x24
    bool bInvalidatesCellList; // 0x25
};

struct SCRIPT_HEADER {
    uint variableCount; // 0x00
    uint refObjectCount; // 0x04
    uint dataSize; // 0x08
    uint m_uiLastID; // 0x0c
    bool bIsQuestScript; // 0x10
    bool bIsMagicEffectScript; // 0x11
    bool bIsCompiled; // 0x12

    void Endian();
};

struct SCRIPT_LINE {
    uint uiLineNumber; // 0x000
    char pLine[512]; // 0x004
    uint uiSize; // 0x204
    uint uiOffset; // 0x208
    char pOutput[512]; // 0x20c
    uint uiOutputSize; // 0x40c
    SCRIPT_OUTPUT sExpression; // 0x410
    uint uiRefObjectIndex; // 0x414
    SCRIPT_ERROR eScriptError; // 0x418
};

struct SCRIPT_LOCAL {
    uint uiID; // 0x00
    double fValue; // 0x08
    bool bIsInteger; // 0x10

    void Endian();
};

struct SCRIPT_OPERATOR {
    EXPRESSION_OPERATORS eCode; // 0x0
    char cPrecedence; // 0x4
    char pOperator[3]; // 0x5
};

struct SCRIPT_PARAMETER {
    char *pParamName; // 0x0
    SCRIPT_PARAM_TYPE eParamType; // 0x4
    bool bOptional; // 0x8
};

struct SCRIPT_PARAMETER_DEF {
    SCRIPT_PARAM_TYPE eParamType; // 0x0
    bool bCanBeVariable; // 0x4
    bool bReferencedObject; // 0x5
};

struct SCRIPT_REFERENCED_OBJECT {
    BSStringT<char> cEditorID; // 0x0
    TESForm *pForm; // 0x8
    uint uiVariableID; // 0xc

    SCRIPT_REFERENCED_OBJECT(const SCRIPT_REFERENCED_OBJECT &);
    SCRIPT_REFERENCED_OBJECT(SCRIPT_REFERENCED_OBJECT *);
    SCRIPT_REFERENCED_OBJECT();
    ~SCRIPT_REFERENCED_OBJECT();
    SCRIPT_REFERENCED_OBJECT &operator=(const SCRIPT_REFERENCED_OBJECT &);
};

struct SCRIPT_WORD {
    char pText[512]; // 0x000
    uint uiRefObjectIndex; // 0x200
    char cVariableType; // 0x204
    SCRIPT_OUTPUT eFunctionCode; // 0x208
    uint uiVariableID; // 0x20c
    TESForm *pForm; // 0x210
};

class ScriptLocals {
public:
    ScriptLocals();
    ~ScriptLocals();
    void ClearActionFlags();
    bool SetActionFlag(TESForm *, uint);
    void AddActionObject(TESForm *);
    bool CheckActionFlag(TESForm *, uint);
    ACTION_OBJECT *GetActionObject(TESForm *, bool);
    void Save(SCRIPT_HEADER *);
    void ClearActionList();
    void ClearVariableList();
    void CopyActionList(ScriptLocals *);
    BSSimpleList<ACTION_OBJECT *> *GetActionList();
    void InitializeData(Script *);
    void SetVariable(uint, double);
    double GetVariable(uint, Script *);
    BSSimpleList<SCRIPT_LOCAL *> *GetLocalList();
    bool IsReferenceVariable(uint);
    unsigned short GetSaveSize();
    void SaveGame(BGSSaveFormBuffer *);
    void SaveGame();
    void LoadGame(BGSLoadFormBuffer *);
    void LoadGame();
    void Revert(BGSLoadFormBuffer *);
    void Revert();

    static void ClearOptimizations();

    Script *m_pMasterScript; // 0x00
    char m_cFlags; // 0x04
    BSSimpleList<ACTION_OBJECT *> *m_pActionList; // 0x08
    BSSimpleList<SCRIPT_LOCAL *> *m_pLocalList; // 0x0c
    SCRIPT_EFFECT_DATA *m_pScriptEffectData; // 0x10

protected:
    static ScriptLocals *pLastVarSearchScriptLocals;
    static uint iLastVarSearchID;
    static SCRIPT_LOCAL *pLastVar;
};
