#pragma once

#include "fallout_shared/tesform.h"
#include "fallout_shared/tesobject.h"
#include "fallout_shared/tesscriptshared.h"
#include "fallout_shared/tesscriptvariable.h"
#include "fallout_shared/tesscriptcompiler.h"

class Script : public TESForm {
public:
    Script(const Script &);
    Script();
    virtual ~Script();
    virtual void InitializeData();
    virtual void ClearData();
    void Init(ScriptCompileData *);
    bool NeedsUpdate(ScriptCompileData *);
    void CopyResultScript(Script *);
    bool CompareResultScripts(Script *);
    void SetCompileData(unsigned int, char *);
    void SaveResultScript();
    virtual void Save();
    virtual bool SaveEdit(TESFile *);
    virtual bool Load(TESFile *);
    SCRIPT_HEADER *GetHeader();
    char *GetText();
    unsigned int GetTextLength() const;
    void SetText(const char *);
    char *GetCompiledData();
    ScriptLocals *CloneLocals();
    BSSimpleList<SCRIPT_LOCAL *> *CreateLocalList();
    bool Run(TESObjectREFR *, ScriptLocals *, TESObjectREFR *, bool);
    void RunScriptEffectStart(TESObjectREFR *, ScriptLocals *);
    void RunScriptEffectFinish(TESObjectREFR *, ScriptLocals *);
    void RunScriptEffectUpdate(TESObjectREFR *, ScriptLocals *, float);
    void CompileAndRun(ScriptCompiler *, COMPILER_NAME, TESObjectREFR *);
    const char *GetVariableName(unsigned int);
    unsigned int ConvertIndexToID(unsigned int);
    char FindVariable(const char *, unsigned int *);
    void InitItem(TESForm *);
    virtual void InitItem();
    bool GetIsCompiled();
    void SetIsCompiled(bool);
    //    void SetOwnerQuest(TESQuest*);
    //    TESQuest* GetOwnerQuest();
    BSSimpleList<ScriptVariable *> *GetVariableList();
    SCRIPT_REFERENCED_OBJECT *GetReferencedObject(unsigned int, ScriptLocals *);
    BSSimpleList<SCRIPT_REFERENCED_OBJECT *> *GetReferencedObjectList();
    void ClearProfilerTimer();
    void AddProfilerTime(float);
    float GetProfilerTimer();
    float GetQuestScriptGetSecondsBuffer();

protected:
    void ClearLocalVariableRefObjects();
    void ClearAllReferenceObjects();
    void ClearVariableList();
    void EndianData();

private:
    SCRIPT_HEADER m_header; // 0x28
    char *m_text; // 0x3c
    char *m_data; // 0x40
    float fProfilerTimer; // 0x44
    float fQuestScriptDelay; // 0x48
    float fQuestScriptGetSecondsBuffer; // 0x4c
    //   TESQuest* pOwnerQuest; // 0x50
    BSSimpleList<SCRIPT_REFERENCED_OBJECT *> listRefObjects; // 0x54
    BSSimpleList<ScriptVariable *> listVariables; // 0x5c
    static TESForm *pCrimeVictim;
    //   static BSCriticalSection ScriptRefListCrit;
    static BSSimpleList<TESObjectREFR *> ReferencesToEnable;
    static BSSimpleList<TESObjectREFR *> ReferencesToDisable;
    static BSSimpleList<TESObjectREFR *> ReferencesToDelete;
    static BSSimpleList<TESObjectREFR *> ReferencesToFadeDisable;
    static bool m_bSystemOutput;
    static char m_cButtonValue;
    static unsigned int m_iButtonOwner;
    static Script *pLastRefSearchScript;
    static ScriptLocals *pLastScriptLocals;
    static unsigned int iLastRefSearchIndex;
    static SCRIPT_REFERENCED_OBJECT *pLastRefObject;

#pragma region Every Script Builtin
public:
    static bool VerboseOutput();
    static void SavePendingReferences(BGSSaveFormBuffer *);
    static void LoadPendingReferences(BGSLoadFormBuffer *);
    static void RevertPendingReferences(BGSLoadFormBuffer *);
